nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt595/eiq_examples/tensorflow_lite_micro_xaf_fusionf1/cm33/pin_mux.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC4 0x04u            /*!<@brief Selects pin function 4 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PMIC_I2C_SCL (coord K4), U30[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_I2C_SCL_PERIPHERAL FLEXCOMM15 /*!<@brief Peripheral name */
#define BOARD_INITPINS_PMIC_I2C_SCL_SIGNAL SCL            /*!<@brief Signal name */
                                                          /* @} */

/*! @name PMIC_I2C_SDA (coord K6), U30[E5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_PMIC_I2C_SDA_PERIPHERAL FLEXCOMM15 /*!<@brief Peripheral name */
#define BOARD_INITPINS_PMIC_I2C_SDA_SIGNAL SDA            /*!<@brief Signal name */
                                                          /* @} */

/*! @name FC0_TXD_SCL_MISO_WS (coord G16), J45[32]/U105[3]/U9[12]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_UART_TXD_PERIPHERAL FLEXCOMM0           /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_TXD_SIGNAL TXD_SCL_MISO_WS         /*!<@brief Signal name */
                                                                     /* @} */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord H16), J45[22]/U9[13]/U105[4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DEBUG_UART_RX_PERIPHERAL FLEXCOMM0           /*!<@brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_RX_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
                                                                    /* @} */

/*! @name MCLK (coord M5), JP27[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_MCLK_PERIPHERAL CLKCTL /*!<@brief Peripheral name */
#define BOARD_INITPINS_MCLK_SIGNAL MCLK       /*!<@brief Signal name */
                                              /* @} */

/*! @name I3C0_SCL (coord B10), J18[1]/U8[2]/U114[A1]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_SCL_PERIPHERAL I3C0               /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_SCL_SIGNAL SCL                    /*!<@brief Signal name */
                                                              /* @} */

/*! @name I3C0_SDA (coord D10), J18[2]/U8[3]/U114[A2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_SDA_PERIPHERAL I3C0               /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_SDA_SIGNAL SDA                    /*!<@brief Signal name */
                                                              /* @} */

/*! @name I3C0_PUR (coord C14), J18[3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I3C0_PUR_PERIPHERAL I3C0   /*!<@brief Peripheral name */
#define BOARD_INITPINS_I3C0_PUR_SIGNAL PUR        /*!<@brief Signal name */
                                                  /* @} */

/*! @name PDM_CLK01 (coord P2), J31[3]/J31[5]/J31[7]/J31[9]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINS_DMIC_PDM_CLK01_PERIPHERAL DMIC0
/*!
 * @brief Signal name */
#define BOARD_INITPINS_DMIC_PDM_CLK01_SIGNAL CLK
/*!
 * @brief Signal channel */
#define BOARD_INITPINS_DMIC_PDM_CLK01_CHANNEL 01
/* @} */

/*! @name PDM_DATA01 (coord P3), J31[4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DMIC_PDM_DAT01_PERIPHERAL DMIC0      /*!<@brief Peripheral name */
#define BOARD_INITPINS_DMIC_PDM_DAT01_SIGNAL DATA           /*!<@brief Signal name */
#define BOARD_INITPINS_DMIC_PDM_DAT01_CHANNEL 01            /*!<@brief Signal channel */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
